function generateSongText(num) {
  let result = "";

  for (let i = num; i >= 1; i--) {
    let b = i % 10 === 1;

    if (b) {
      result = `${i} бутылка пива на стене, ${i} бутылка пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылок пива на стене!`;
    } else if (i >= 1 && i < 5) {
      result = `${i} бытылки пива на стене, ${i} бытылки пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылок пива на стене!`;
    } else {
      result = `${i} бутылок пива на стене, ${i} бутылок пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылок пива!`;
    }
    console.log(result);
  }
}
generateSongText(99);
