function generateSongText(num) {
  let result = "";

  for (let i = num; i >= 1; i--) {
    let b = i % 10 === 1;
  

    if (b) {
      result = `${i} бутылка пива на стене, ${i} бутылка пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылок пива на стене!`;
    } else if (i > 2 && i <= 4 || i > 12 && i <= 14 || i > 22 && i <= 24 || i > 32 && i <= 34 || i > 42 && i <= 44 || i > 52 && i <= 54 || i > 62 && i <= 64 || i > 72 && i <= 74 || i > 82 && i <= 84 || i > 92 && i <= 94) {
      result = `${i} бутылки пива на стене, ${i} бутылки пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылки пива на стене!`;
    } else if (i === 2 || i === 12 || i === 22 || i === 32 || i === 42 || i === 52 || i === 62 || i === 72 || i === 82 || i === 92) {
      result = `${i} бутылки пива на стене, ${i} бутылки пива!
      Возьми одну, пусти по кругу, ${i - 1} бутылка пива на стене!`;
    } else if (i === 5 || i === 15 || i === 25 || i === 35 || i === 45 || i === 55 || i === 65 || i === 75 || i === 85 || i === 95) {
      result = `${i} бутылок пива на стене, ${i} бутылок пива!
      Возьми одну, пусти по кругу, ${i - 1} бутылки пива на стене!`;
    } else {
      result = `${i} бутылок пива на стене, ${i} бутылок пива!
    Возьми одну, пусти по кругу, ${i - 1} бутылок пива!`;
    }
    console.log(result);
  }
}
generateSongText(99)